#include <unistd.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
static const int hex_chars[256] = {
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    0, 1, 2, 3,  4, 5, 6, 7,  8, 9,-1,-1, -1,-1,-1,-1,
    -1,10,11,12, 13,14,15,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,10,11,12, 13,14,15,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
    -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1, -1,-1,-1,-1,
};
static inline int ds_hex2int(const char c)
{
    return hex_chars[(const unsigned char)c];
}
int mac_un2char(const char *hex,unsigned char *dsig)
{
    int hexval, ret = 0, len, i, j = 0;

    if((hex == NULL)||(dsig == NULL))
	return -1;

    len = strlen(hex) ;
    if(len != 17) {
        return -1;
    }

    for(i = 0; i < len; i++) {
        if((i + 1) % 3 == 0) { //:号的处理
            if(hex[i] != ':')
                return -1;
            else
                continue;
        }
        if((i % 3 == 0) && (i != 0 )) { //:后的第一个字符

            dsig[j] = ret;
            ret = 0;
            j++;
        }
			
        if((hexval = ds_hex2int(hex[i])) < 0) {
            return -1;
            //break;
        }
        ret = (ret << 4) | hexval;
    }
    dsig[j] = ret;
    return 0;
}
#if 0
int main()
{
    unsigned char dsig[16];
    int i=0;
    ds_hex2num("00:02:A5:5E:75:05", dsig);
    printf("\n\n");
    for (i=0;i<6;i++)
	printf("%02x",dsig[i]);
}
#endif
